:PROPERTIES:
:ID: AADBEF95-AFD8-4DC0-A4EC-505E47B07F86
:END:
#+title: How do I list available CMake presets?
#+description: Run `cmake --list-presets` to see the configure presets defined in CMakePresets.json.
#+type: recipe
#+level: cross
#+filetags: :cmake:build:presets:recipe:
#+created: 2026-05-18
#+updated: 2026-05-18

For the preset menu and naming convention, see [[id:5AAE6900-8488-4E22-9F31-A1B9D5320EFB][CMake setup]].

* Question

How do I list the CMake presets available in ORE Studio?

* Answer

From the project root:

#+name: list-presets
#+begin_src sh :results verbatim :exports both
cmake --list-presets
#+end_src

#+RESULTS:
#+begin_example
Available configure presets:

  "linux-clang-debug-ninja"             - Linux Clang Debug (Ninja)
  "linux-clang-debug-make"              - Linux Clang Debug (Make)
  "linux-clang-release-ninja"           - Linux Clang Release (Ninja)
  "linux-clang-release-make"            - Linux Clang Release (Make)
  "linux-gcc-debug-ninja"               - Linux GCC Debug (Ninja)
  "linux-gcc-debug-make"                - Linux GCC Debug (Make)
  "linux-gcc-release-ninja"             - Linux GCC Release (Ninja)
  "linux-gcc-release-make"              - Linux GCC Release (Make)
  "windows-msvc-debug-ninja"            - Windows x64 Debug (Ninja)
  "windows-msvc-release-ninja"          - Windows x64 Release (Ninja)
  "windows-msvc-clang-cl-debug-ninja"   - Windows x64 Debug (Ninja)
  "windows-msvc-clang-cl-release-ninja" - Windows x64 Release (Ninja)
  "windows-clang-debug-ninja"           - Windows x64 Debug (Ninja)
  "windows-clang-release-ninja"         - Windows x64 Release (Ninja)
  "macos-clang-debug-ninja"             - Mac OSX Debug (Ninja)
  "macos-clang-debug-make"              - Mac OSX Debug (Make)
  "macos-clang-release-ninja"           - Mac OSX Release (Ninja)
  "macos-clang-release-make"            - Mac OSX Release (Make)
#+end_example

This reads =CMakePresets.json= and prints every configure preset by
name and description. The captured =#+RESULTS:= block above is a
snapshot — re-evaluate the source block (=C-c C-c= in emacs) to refresh
it after preset changes.

* Script

The command above. No wrapper.

* Tested by

Implicit — used in CI to validate presets exist.

* See also

- [[id:5AAE6900-8488-4E22-9F31-A1B9D5320EFB][CMake setup]] — what the presets mean and how they are named.
- [[id:7C44751E-54C0-4CB7-B489-1D3EC609A4E3][How do I configure the project?]] — pick a preset and configure.
